{"home":{"content":"# Javascript APIs\n---\n\nHello, [Wrold](https://medium.com/@the_taqquikarim/console-log-hello-wrold-3e3abeb44396#.ayfqwse40)! Welcome to Javascript APIs.\n\n## Objective\n---\nOur main today is to learn how we can leverage 3rd party APIs to enrich our webpages with dynamic data.\n\nWe will cover **public** APIs only, since those don't require anything more than some js code to configure. Most \"interesting\" APIs typically require a user authentication portion which is beyond the scope of this class.\n\n## Game Plan\n---\nHere is a rough roadmap of class for today.\n\n##### 1. Basics of APIs and AJAX\n\n#### 2. Wrangling Asynchronousness \n\n#### 3. Promises\n\n#### 4. JSONP\n\n#### 5. Writing API Wrappers\n\n## Starter Code\n---\nHere is a **[link](https://github.com/FEWDMaterials/JavascriptAPIs__starter)** to the repo you will need.\n","idx":0},"title":{"content":"Javascript APIs","idx":1},"desc":{"content":"A crash course on APIs, AJAX, and promises.","idx":2},"basics-of-apis-and-ajax":{"content":"\n# Basics of APIs and AJAX\n---\n\nWe will kick things off by discussing the $.get() request and how we can recreate this with pure javascript. \n\nThere are two important bits to tackle here:\n1. **How do we make API calls?**\n2. **How do we process that data once we receive it?**\n\n\n#### Project 1\n\nWe will build a simple Giphy Search Engine. User will input a search query which will lead to results rended as gifs.","idx":3},"wrangling-asynchronousness":{"content":"# Wrangling Asynchronousness \n---\n\nNext, we will talk about the **asynch** problem with handling AJAX requests. What happens when we try to combine a few AJAX calls at once?\n\n#### Project 2\nLet's build a weather app. It will display the weather data from three cities *in order*. For example, if my choices were:\n1. NYC\n2. Palo Alto\n3. Moscow\n\nThen, I should see weather data for NYC before Palo Alto before Moscow.","idx":4},"promises":{"content":"# Promises\n---\n\nWhat are promises and how can we use them to make it easier for us to draw data together from multiple sources?\n\n#### Project 3\n\nLet's combine some APIs. Write an app that, using promises, looks up weather data from a specific city and then shows the user a Gif from giphy that displays the current weather conditions.\n\nIn other words, this app should show us the \"five day forecast\" UI seen in newscasts but instead of pictures of rain clouds or whatnot, it should show gifs tagged with the weather condition from Giphy.\n\nFor example, if it is rainy in NYC tomorrow and cloudy on Tuesday, I expect Monday's image to be:\n\n![rainy](https://media.giphy.com/media/xT5LMStuLNrOPa6hry/giphy.gif)\n\nand Tuesday's image to be:\n\n![cloudy](https://media.giphy.com/media/xT5LMWxitRdSMvtS4E/giphy.gif)\n\netc, etc.\n\n\n","idx":5},"jsonp":{"content":"# JSONP\n---\nWhat is JSONP? Why is it useful to us?\n\n#### Project 4\nBuild an app that generates a GoogleMap and based on the coordinates of the map as user pans, pulls in images from Flickr and displays it for us. \n\nThis project requires JSONP **and** Goole Maps API integration.\n","idx":6},"writing-api-wrappers":{"content":"# Writing API Wrappers\n---\n\nLet's look at the Trello API and see how we can write a javascript driver class which will make it easier for us to make Trello calls as promises.\n\n#### Project 5\nLet's build a simple recipe saving and sharing app with trello.","idx":7},"__list__":["home","title","desc","basics-of-apis-and-ajax","wrangling-asynchronousness","promises","jsonp","writing-api-wrappers"]}